In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'2020':[1234567,4568912,7589642,9348762],'2010':[10312546,4721354,8752256,9875315]}
df = pd.DataFrame(data, index = ['서울','부산','인천','광주'])
df

       2020      2010
서울  1234567  10312546
부산  4568912   4721354
인천  7589642   8752256
광주  9348762   9875315

In [8]:
df.index = ['서울','부산','인천','광주']
df

       2020      2010
서울  1234567  10312546
부산  4568912   4721354
인천  7589642   8752256
광주  9348762   9875315

In [11]:
data = {'2020':[1234567,4568912,7589642,9348762],'2010':[10312546,4721354,8752256,9875315]}
df = pd.DataFrame(data, index = ['서울','부산','인천','광주'])
df
# dataframe은 column으로 값들을 불러올 수 있다

       2020      2010
서울  1234567  10312546
부산  4568912   4721354
인천  7589642   8752256
광주  9348762   9875315

In [21]:
df['2020']

서울    1234567
부산    4568912
인천    7589642
광주    9348762
Name: 2020, dtype: int64

In [24]:
data = [[9234567,4568912,7589642,9348762],[10312546,4721354,8752256,9875315]]
ind = ['2010','2020']
col = ['서울','부산','인천','광주']
df2 = pd.DataFrame(data, index = ind, columns = col)
df2

            서울       부산       인천       광주
2010   9234567  4568912  7589642  9348762
2020  10312546  4721354  8752256  9875315

In [25]:
df2['서울']

2010     9234567
2020    10312546
Name: 서울, dtype: int64

In [35]:
# 행과 열을 변경
df2 = df2.T
df2

       2010      2020
서울  9234567  10312546
부산  4568912   4721354
인천  7589642   8752256
광주  9348762   9875315

In [36]:
df2.values, df2.index, df2.columns

(array([[ 9234567, 10312546],
        [ 4568912,  4721354],
        [ 7589642,  8752256],
        [ 9348762,  9875315]], dtype=int64),
 Index(['서울', '부산', '인천', '광주'], dtype='object'),
 Index(['2010', '2020'], dtype='object'))

In [37]:
df2['2020']

서울    10312546
부산     4721354
인천     8752256
광주     9875315
Name: 2020, dtype: int64

In [50]:
df2 = df2[['2020','2010']]
df2

        2020     2010
서울  10312546  9234567
부산   4721354  4568912
인천   8752256  7589642
광주   9875315  9348762

In [57]:
df2['2005'] = [9762546,3512547,2517680,1456016]
df2

        2020     2010     2005
서울  10312546  9234567  9762546
부산   4721354  4568912  3512547
인천   8752256  7589642  2517680
광주   9875315  9348762  1456016

In [59]:
df2[:2]

        2020     2010     2005
서울  10312546  9234567  9762546
부산   4721354  4568912  3512547

#### loc, iloc
    loc : 인덱스 이름, column이름을 사용해서 값을 가져올 때 
    iloc : 인덱스 번호를 사용해서 값을 가져올 때

In [72]:
df2.loc['부산':'인천','2020':'2010']

       2020     2010
부산  4721354  4568912
인천  8752256  7589642

In [81]:
df2.iloc[1:3,:2]

       2020     2010
부산  4721354  4568912
인천  8752256  7589642

In [87]:
df2[df2['2010']>=8000000]

        2020     2010     2005
서울  10312546  9234567  9762546
광주   9875315  9348762  1456016

#### CSV 파일

In [3]:
population = pd.read_csv("population.csv", encoding="cp949")
# encoding="utf-8" 안되면 encoding="cp949", "euc-kr"
population

   도시   지역     2015       2010       2005     2000
0  서울  수도권  9904312  9631482.0  9762546.0  9853972
1  부산  경상권  3448737        NaN        NaN  3655437
2  인천  수도권  2890451  2632035.0        NaN  2466338
3  대구  경상권  2466052  2431774.0  2456016.0  2473990

In [4]:
population = pd.read_csv("population.csv", index_col='도시', encoding="cp949")
population

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [5]:
# index 오름차순으로 정렬
population.sort_index()

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437
서울  수도권  9904312  9631482.0  9762546.0  9853972
인천  수도권  2890451  2632035.0        NaN  2466338

In [6]:
population['2010'].sort_values()

도시
대구    2431774.0
인천    2632035.0
서울    9631482.0
부산          NaN
Name: 2010, dtype: float64

In [7]:
population['2010'].sort_values(ascending=False)

도시
서울    9631482.0
인천    2632035.0
대구    2431774.0
부산          NaN
Name: 2010, dtype: float64

In [8]:
# 원하는 column 기준으로 dataframe 정렬 보고 싶을 때
population.sort_values(by='2010')

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
인천  수도권  2890451  2632035.0        NaN  2466338
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437

In [108]:
population.sort_values(by='2015', ascending=False)

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [111]:
population.sort_values(by=['지역','2015'])

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
서울  수도권  9904312  9631482.0  9762546.0  9853972

In [112]:
population.sort_values(by=['지역','2015'], ascending=False)

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
인천  수도권  2890451  2632035.0        NaN  2466338
부산  경상권  3448737        NaN        NaN  3655437
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [9]:
score = pd.read_csv('score.csv',  encoding="cp949", index_col='과목')
score

     1반  2반  3반  4반
과목
파이썬  45  44  73  39
DB   76  92  45  69
자바   47  92  45  69
크롤링  92  81  85  40
Web  11  79  47  26

In [153]:
score.sum()

1반    271
2반    388
3반    295
4반    243
dtype: int64

In [154]:
score.sum().sort_values()

4반    243
1반    271
3반    295
2반    388
dtype: int64

In [15]:
score.sum(axis=1)

과목
파이썬    201.0
DB     282.0
자바     253.0
크롤링    298.0
Web    163.0
dtype: float64

In [16]:
score.sum(axis=0)

1반    271.0
2반    388.0
3반    295.0
4반    243.0
평균      0.0
dtype: float64

In [156]:
score['합계'] = score.sum(axis=1)

In [158]:
score

     1반  2반  3반  4반   합계
과목
파이썬  45  44  73  39  201
DB   76  92  45  69  282
자바   47  92  45  69  253
크롤링  92  81  85  40  298
Web  11  79  47  26  163

In [20]:
score['평균'] = score.loc[:,:'4반'].mean(axis=1)
score

     1반  2반  3반  4반     평균
과목
파이썬  45  44  73  39  50.25
DB   76  92  45  69  70.50
자바   47  92  45  69  63.25
크롤링  92  81  85  40  74.50
Web  11  79  47  26  40.75

In [21]:
score['평균'] = score.loc[:'Web',:].mean(axis=0)
score

     1반  2반  3반  4반  평균
과목
파이썬  45  44  73  39 NaN
DB   76  92  45  69 NaN
자바   47  92  45  69 NaN
크롤링  92  81  85  40 NaN
Web  11  79  47  26 NaN

In [165]:
#column별       row별
score.max(), score.max(axis=1)

(1반     92.0
 2반     92.0
 3반     85.0
 4반     69.0
 합계    298.0
 평균     74.5
 dtype: float64,
 과목
 파이썬    201.0
 DB     282.0
 자바     253.0
 크롤링    298.0
 Web    163.0
 dtype: float64)

In [164]:
#column별       row별
score.min(), score.min(axis=1)

(1반     11.00
 2반     44.00
 3반     45.00
 4반     26.00
 합계    163.00
 평균     40.75
 dtype: float64,
 과목
 파이썬    39.0
 DB     45.0
 자바     45.0
 크롤링    40.0
 Web    11.0
 dtype: float64)

In [172]:
maxArr = score.loc[:,:'4반'].max(axis=1)

In [173]:
minArr = score.loc[:,:'4반'].min(axis=1)

In [174]:
maxArr-minArr

과목
파이썬    34
DB     47
자바     47
크롤링    52
Web    68
dtype: int64

In [23]:
score.drop(['Web'],axis=0)

     1반  2반  3반  4반  평균
과목
파이썬  45  44  73  39 NaN
DB   76  92  45  69 NaN
자바   47  92  45  69 NaN
크롤링  92  81  85  40 NaN

In [189]:
score.drop(['합계'],axis=1)

     1반  2반  3반  4반     평균
과목
파이썬  45  44  73  39  50.25
DB   76  92  45  69  70.50
자바   47  92  45  69  63.25
크롤링  92  81  85  40  74.50
Web  11  79  47  26  40.75

In [25]:
data_dic = {'A':[1,3,3,4,4],'B':[1,2,2,3,3],'C':[1,2,4,4,5]}
df3=pd.DataFrame(data_dic)
df3

   A  B  C
0  1  1  1
1  3  2  2
2  3  2  4
3  4  3  4
4  4  3  5

In [193]:
# 원소 개수 count, dataframe 형식으로 나옴
# 원소 종류가 row로 들어감
df4 = df3.apply(pd.value_counts)
df4

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [198]:
# NaN 값을 원하는 값으로 변경
df4.fillna(0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [205]:
# 카테고리 만들기(간단한 표)
ages = [0,2,10,21,23,37,31,61,20,41,32,100]
bins = [0,15,25,35,60,99]
labels = ["미성년자","청년","중년","장년","노년"]
cats = pd.cut(ages,bins,labels=labels)  #(data,범위,구분 label)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '노년', '청년', '장년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [206]:
cats.shape, cats.size, cats.ndim

((12,), 12, 1)

In [207]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [217]:
ageArr = pd.DataFrame(ages,columns=['ages'])
ageArr['age_cats'] = cats
ageArr

    ages age_cats
0      0      NaN
1      2     미성년자
2     10     미성년자
3     21       청년
4     23       청년
5     37       장년
6     31       중년
7     61       노년
8     20       청년
9     41       장년
10    32       중년
11   100      NaN

In [218]:
ageArr['age_cats'].value_counts()
# null 값은 제외하고 counting

청년      3
미성년자    2
중년      2
장년      2
노년      1
Name: age_cats, dtype: int64

#### data 합치기

In [28]:
df1 = pd.DataFrame({'A' : ['A0', 'A1', 'A2', 'A3'],
                    'B' : ['B0', 'B1', 'B2', 'B3'],
                    'C' : ['C0', 'C1', 'C2', 'C3'],
                    'D' : ['D0', 'D1', 'D2', 'D3']}, index = [0,1,2,3])
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                   'B':['B4','B5','B6','B7'],
                   'C':['C4','C5','C6','C7'],
                   'D':['D4','D5','D6','D7']}, index=[4,5,6,7])
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],
                    'B':['B8','B9','B10','B11'],
                    'C':['C8','C9','C10','C11'],
                    'D':['D8','D9','D10','D11']}, index=[8,9,10,11])

In [29]:
# dataFrame 합치기
result = pd.concat([df1,df2,df3], keys = ['x','y','z'])
# keys로 속성 부여
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [30]:
result.index

MultiIndex([('x',  0),
            ('x',  1),
            ('x',  2),
            ('x',  3),
            ('y',  4),
            ('y',  5),
            ('y',  6),
            ('y',  7),
            ('z',  8),
            ('z',  9),
            ('z', 10),
            ('z', 11)],
           )

In [31]:
print(result.index.get_level_values(0))
print(result.index.get_level_values(1))    # index 순서 넣으면 됨

Index(['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y', 'z', 'z', 'z', 'z'], dtype='object')
Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [32]:
df4 = pd.DataFrame({'B':['B2','B3','B6','B7'],
                    'D':['D2','D3','D6','D7'],
                    'F':['F2','F3','F6','F7'],}, index=[2,3,6,7])

In [33]:
result = pd.concat([df1,df4],axis=1)
result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [34]:
result = pd.concat([df1,df4])
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [35]:
result1 = result.apply(pd.value_counts)
print(result1.fillna(0))
print(result1.fillna(0).apply(pd.value_counts))

      A    B    C    D    F
A0  1.0  0.0  0.0  0.0  0.0
A1  1.0  0.0  0.0  0.0  0.0
A2  1.0  0.0  0.0  0.0  0.0
A3  1.0  0.0  0.0  0.0  0.0
B0  0.0  1.0  0.0  0.0  0.0
B1  0.0  1.0  0.0  0.0  0.0
B2  0.0  2.0  0.0  0.0  0.0
B3  0.0  2.0  0.0  0.0  0.0
B6  0.0  1.0  0.0  0.0  0.0
B7  0.0  1.0  0.0  0.0  0.0
C0  0.0  0.0  1.0  0.0  0.0
C1  0.0  0.0  1.0  0.0  0.0
C2  0.0  0.0  1.0  0.0  0.0
C3  0.0  0.0  1.0  0.0  0.0
D0  0.0  0.0  0.0  1.0  0.0
D1  0.0  0.0  0.0  1.0  0.0
D2  0.0  0.0  0.0  2.0  0.0
D3  0.0  0.0  0.0  2.0  0.0
D6  0.0  0.0  0.0  1.0  0.0
D7  0.0  0.0  0.0  1.0  0.0
F2  0.0  0.0  0.0  0.0  1.0
F3  0.0  0.0  0.0  0.0  1.0
F6  0.0  0.0  0.0  0.0  1.0
F7  0.0  0.0  0.0  0.0  1.0
        A   B     C   D     F
0.0  20.0  18  20.0  18  20.0
1.0   4.0   4   4.0   4   4.0
2.0   NaN   2   NaN   2   NaN

#### concat
    innerjoin : 겹치는 부분만 합치기
    outerjoin(fulljoin) : 모두 합치기

In [240]:
result = pd.concat([df1,df4],axis=1,join='inner')
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [244]:
result = pd.concat([df1,df4],join='inner')
result

    B   D
0  B0  D0
1  B1  D1
2  B2  D2
3  B3  D3
2  B2  D2
3  B3  D3
6  B6  D6
7  B7  D7

In [242]:
result = pd.concat([df1,df4],axis=1,join='outer')
result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [245]:
result = pd.concat([df1,df4],join='outer')
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [261]:
# 기존 index 무시하고 새로 index 부여
result = pd.concat([df1,df4],ignore_index = True)
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [262]:
result = pd.concat([df1,df4],axis=1,ignore_index = True)
result

     0    1    2    3    4    5    6
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7